app/views/questions/show.html.erb

SELECT "answers".* FROM "answers"  WHERE "answers"."question_id" = ?  [["question_id", 14]]
SELECT "users".* FROM "users"
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
---
<h2>Answers</h2>
<% @question.answers.each do |answer| %>
<p>
  <% @user = User.all %>
  <%= @user.find(answer.user_id).email %>: <%= answer.body %>