app/controllers/answers_controller.rb

SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = ? LIMIT 1  [["id", 14]]
INSERT INTO "answers" ("body", "created_at", "question_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "lkasdlfkjdsalkfjdslf\r\n"], ["created_at", "2014-12-18 19:48:04.648901"], ["question_id", 2], ["updated_at", "2014-12-18 19:48:04.648901"], ["user_id", 1]]
---
  def create
    @question = Question.find(params[:question_id])
    @answer = Answer.create(answer_params)