app/controllers/questions_controller.rb

INSERT INTO "questions" ("created_at", "text", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-12-17 19:58:17.309683"], ["text", "ALSDfjadslkjfjadsklsdfdsfdsfdsfsdffjlkdasjf\r\n"], ["title", "lalalalalalalalal"], ["updated_at", "2014-12-17 19:58:17.309683"]]
---
  def create
    @question = Question.new(question_params)
    @question.user_id = current_user.id
    if @question.save

SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "questions" SET "text" = ?, "title" = ?, "updated_at" = ? WHERE "questions"."id" = 2  [["text", "kfjdslkfjaslkfjlasdkfjlksadjflksdjflkdsjf"], ["title", "lkajsflkjsdklfjsdalkfjdklj"], ["updated_at", "2014-12-16 19:12:41.098125"]]
---
  def update
    @question = Question.find(params[:id])
    if @question.user_id == current_user.id
      if @question.update(question_params)

SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = ? LIMIT 1  [["id", 6]]
DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 6]]
---
  def destroy
    @question = Question.find(params[:id])
    if @question.user_id == current_user.id
    @question.destroy